RT-Thread/rt-thread/bsp/at32/libraries/AT32F45x_Firmware_Library/drivers/src/at32f45x_flash.c
  /* unlock slib cfg register */
  FLASH->slib_unlock = SLIB_UNLOCK_KEY;
  while(FLASH->slib_misc_sts_bit.slib_ulkf==RESET);

  slib_range = ((uint32_t)(inst_start_sector << 11) & FLASH_SLIB_INST_START_SECTOR) | \
               ((uint32_t)(end_sector << 22) & FLASH_SLIB_END_SECTOR) | \
               (start_sector & FLASH_SLIB_START_SECTOR);
  /* configure slib, set pwd and range */
  FLASH->slib_set_pwd = pwd;
  status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);
  if(status == FLASH_OPERATE_DONE)
  {
    FLASH->slib_set_range = slib_range;
    status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);
  }

  return status;
}

/**
  * @brief  disable main block slib when slib enabled.
  * @param  pwd: slib password
  * @retval success or error
  */
error_status flash_slib_disable(uint32_t pwd)
{
  flash_status_type status = FLASH_OPERATE_DONE;
  /* write password to disable slib */
  FLASH->slib_pwd_clr = pwd;

  status = flash_operation_wait_for(ERASE_TIMEOUT);
  if(status == FLASH_OPERATE_DONE)
  {
    if(FLASH->slib_misc_sts_bit.slib_pwd_ok)
      return SUCCESS;
    else
      return ERROR;
  }
  return ERROR;
}

/**
  * @brief  get the main block slib state.
  * @param  none
  * @retval SET or RESET
  */
flag_status flash_slib_state_get(void)
{
  if(FLASH->slib_sts0_bit.slib_enf)
    return SET;
  else
    return RESET;
}

/**
 * @brief  get the main block start sector of slib.
 * @param  none
 * @retval uint16_t
 */
uint16_t flash_slib_start_sector_get(void)
{
  return (uint16_t)FLASH->slib_sts1_bit.slib_ss;
}

/**
 * @brief  get the main block inst start sector of slib.
 * @param  none
 * @retval uint16_t
 */
uint16_t flash_slib_inststart_sector_get(void)
{
  return (uint16_t)FLASH->slib_sts1_bit.slib_inst_ss;
}

/**
 * @brief  get the main block end sector of slib.
 * @param  none
 * @retval uint16_t
 */
uint16_t flash_slib_end_sector_get(void)
{
  return (uint16_t)FLASH->slib_sts1_bit.slib_es;
}

/**
  * @brief  flash crc calibration.
  * @param  start_addr: crc calibration start sector address
  *         sector_cnt: crc calibration sector count
  * @retval uint32: crc calibration result
  */
uint32_t flash_crc_calibrate(uint32_t start_addr, uint32_t sector_cnt)
{
  FLASH->crc_addr = start_addr;
  FLASH->crc_ctrl = sector_cnt | 0x10000;
  flash_operation_wait_for(OPERATION_TIMEOUT);
  return FLASH->crc_chkr;
}

/**
  * @brief  enable boot memory as extension mode.
  * @note   this function is irreversible, can not disable!!!
  * @param  none
  * @retval none.
  */
void flash_boot_memory_extension_mode_enable(void)
{
  if(FLASH->slib_sts0_bit.btm_ap_enf == RESET)
  {
    FLASH->slib_unlock = SLIB_UNLOCK_KEY;
    while(FLASH->slib_misc_sts_bit.slib_ulkf==RESET);
    FLASH->btm_mode_set = 0;
    flash_operation_wait_for(OPERATION_TIMEOUT);
  }
}

/**
  * @brief  enable extension memory security library function.
  * @param  pwd: slib password
  *         inst_start_sector: extension memory security library i-bus area start sector, range 0~3 or 0xFF
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_extension_memory_slib_enable(uint32_t pwd, uint16_t inst_start_sector)
{
  flash_status_type status = FLASH_OPERATE_DONE;

  /* unlock slib cfg register */
  FLASH->slib_unlock = SLIB_UNLOCK_KEY;
  while(FLASH->slib_misc_sts_bit.slib_ulkf==RESET);

  /* configure slib, set pwd and range */
  FLASH->slib_set_pwd = pwd;
  status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);
  if(status == FLASH_OPERATE_DONE)
  {
    FLASH->em_slib_set  = (uint32_t)(inst_start_sector << 16) + (uint32_t)0x5AA5;
    status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);
  }

  return status;
}

/**
  * @brief  get the extension memory slib state.
  * @param  none
  * @retval SET or RESET
  */
flag_status flash_extension_memory_slib_state_get(void)
{
  if(FLASH->slib_sts0_bit.em_slib_enf)
    return SET;
  else
    return RESET;
}

/**
 * @brief  get the extension memory inst start sector of slib.
 * @param  none
 * @retval uint16_t
 */
uint16_t flash_em_slib_inststart_sector_get(void)
{
  return (uint16_t)FLASH->slib_sts0_bit.em_slib_inst_ss;
}

/**
  * @brief  start programing otp data from the specified address.
  * @note   the otp data can't erase!
  * @param  address: specifies the address to be programmed. the starting address is OTP_DATA_BASE.
  * @param  data_buf: specifies the otp data pointer to be programmed.
  * @param  length: specifies the length to be programmed.
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_otp_data_program(uint32_t address, uint8_t *data_buf, uint16_t length)
{
  flash_status_type status = FLASH_OPERATE_DONE;

  FLASH->ctrl_bit.fprgm = TRUE;
  while(length--)
  {
    *(__IO uint8_t*)(address++) = *(data_buf++);
    /* wait for operation to be completed */
    status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);
    if(status != FLASH_OPERATE_DONE)
      break;
  }
  /* disable the fprgm bit */
  FLASH->ctrl_bit.fprgm = FALSE;

  return status;
}

/**
  * @brief  lock the specified otp data area.
  * @note   when the specified otp data area locked, it can't unlock!
  * @param  area_index: lock otp area index(0~31).
  *         each index corresponds to 32 bytes of otp data, locked otp data area starting address is OTP_DATA_BASE + 32 * area_index.
  * @retval status: the returned value can be: FLASH_PROGRAM_ERROR,
  *         FLASH_EPP_ERROR, FLASH_OPERATE_DONE or FLASH_OPERATE_TIMEOUT.
  */
flash_status_type flash_otp_lock_enable(uint8_t area_index)
{
  flash_status_type status = FLASH_OPERATE_DONE;

  FLASH->ctrl_bit.fprgm = TRUE;

  *(__IO uint8_t*)(OTP_LOCK_BASE + area_index) = 0x00;
  /* wait for operation to be completed */
  status = flash_operation_wait_for(PROGRAMMING_TIMEOUT);

  /* disable the fprgm bit */
  FLASH->ctrl_bit.fprgm = FALSE;

  return status;
}

/**
  * @}
  */

#endif

/**
  * @}
  */

/**
  * @}
  */
